БПКР/src/Documents/ОтчетПоНСП/ОтчетПоНСП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетПоНСП</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСубъекта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>EnumRef.ВидыОтчетаПоНалогам</types>
    </type>
  </attributes>
  <attributes>
    <name>ГНС</name>
    <type>
      <types>CatalogRef.ГНС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтчетОсновной</name>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выручка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНСП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПриложениеПервыйМесяцКвартала</name>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выручка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНСП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПриложениеВторойМесяцКвартала</name>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выручка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНСП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПриложениеТретийМесяцКвартала</name>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выручка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНСП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БПКР/src/InformationRegisters/СтавкиНСП/СтавкиНСП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтавкиНСП</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНСП</name>
    <type>
      <types>CatalogRef.СтавкиНСП</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНСП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСкидки</name>
    <comment>Используется для указания суммы скидки на конкретную позицию товара</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСкидкиСНалогами</name>
    <comment>Используется для указания суммы скидки с налогами на конкретную позицию товара</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДохода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНСП</name>
    <type>
      <types>CatalogRef.СтавкиНСП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БезналичныйРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭкспортУслугПокупателюКР</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БезвозмезднаяПоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРеализации</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.РозничнаяПродажа</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.КорректировкаСтоимостиРеализации</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БПКР/src/AccumulationRegisters/ПродажиОсновныхСредств/ПродажиОсновныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПродажиОсновныхСредств</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНСП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСкидки</name>
    <comment>Используется для указания суммы скидки на конкретную позицию товара</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСкидкиСНалогами</name>
    <comment>Используется для указания суммы скидки с налогами на конкретную позицию товара</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДохода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНСП</name>
    <type>
      <types>CatalogRef.СтавкиНСП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БезналичныйРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРеализации</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.КорректировкаСтоимостиРеализации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БПКР/src/Enums/ПризнакиСтраны/ПризнакиСтраны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПризнакиСтраны</name>
  <enumValues>
    <name>КР</name>
  </enumValues>
  <enumValues>
    <name>ЕАЭС</name>
    <comment>Страны Евразийского экономического союза</comment>
  </enumValues>
  <enumValues>
    <name>ИмпортЭкспорт</name>
    <comment>Страны за пределами Евразийского экономического союза</comment>
  </enumValues>
</mdclass:Enum>

БПКР/src/Catalogs/СтавкиНСП/СтавкиНСП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтавкиНСП</name>
  <predefined>
    <items>
      <name>ЗастройщикиЖилья</name>
      <description>Застройщики жилья</description>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
    </items>
    <items>
      <name>ПрочееОсвобожденные</name>
      <description>Прочее (освобожденные)</description>
    </items>
    <items>
      <name>СотоваяСвязь</name>
      <description>Сотовая связь</description>
    </items>
    <items>
      <name>Торговля</name>
      <description>Торговля и производство</description>
    </items>
    <items>
      <name>ТорговляОсвобожденные</name>
      <description>Торговля и производство (освобожденные)</description>
    </items>
    <items>
      <name>УслугиБанка</name>
      <description>Услуги банка</description>
    </items>
  </predefined>
</mdclass:Catalog>

БПКР/src/Documents/ОтчетПоНСП/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовБП.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = КонецМесяца(ТекущаяДатаСеанса());
		Если ЕстьДокументВУказанныйПериод(Дата) Тогда
			Дата = Дата('00010101');
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// Предварительный контроль
	ВыполнитьПредварительныйКонтроль(Отказ);	
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

// Процедура выполняет контроль противоречий.
//
Процедура ВыполнитьПредварительныйКонтроль(Отказ)
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;	
КонецПроцедуры

Функция ЕстьДокументВУказанныйПериод(Дата)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПоНСП.Ссылка
		|ИЗ
		|	Документ.ОтчетПоНСП КАК ОтчетПоНСП
		|ГДЕ
		|	НЕ ОтчетПоНСП.ПометкаУдаления
		|	И КОНЕЦПЕРИОДА(ОтчетПоНСП.Дата, МЕСЯЦ) = &Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата);		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Количество() > 0 	

КонецФункции 

// Процедура заполняет табличную часть ОтчетОсновной
//
Процедура Старая_ЗаполнитьТабличнуюЧастьОтчетПоНСП() Экспорт

	ДанныеУчетнойПолитики = БухгалтерскийУчетСервер.ПолучитьДанныеУчетнойПолитикиОрганизаций(Дата, Организация);	
		
	Если ДанныеУчетнойПолитики.ПлательщикНДС Тогда 
		Секция = 1;
	Иначе 
		Секция = 2;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	СтавкиНСПСрезПоследних.Ставка КАК Ставка,
		|	СтавкиНСПСрезПоследних.СтавкаНСП КАК СтавкаНСП
		|ПОМЕСТИТЬ ВременнаяТаблицаСтавкиНСПСрезПоследних
		|ИЗ
		|	РегистрСведений.СтавкиНСП.СрезПоследних(&КонецПериода, Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.БезналичныйРасчет КАК БезналичныйРасчет,
		|	ПродажиОбороты.СуммаДоходаОборот КАК Выручка,
		|	ПродажиОбороты.СуммаНСПОборот КАК СуммаНСП,
		|	ВременнаяТаблицаСтавкиНСПСрезПоследних.Ставка КАК Ставка,
		|	ПродажиОбороты.СтавкаНСП КАК СтавкаНСП
		|ПОМЕСТИТЬ ВременнаяТаблицаПродажа
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			Организация = &Организация
		|				И Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				И НЕ ЭкспортУслугПокупателюКР
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСтавкиНСПСрезПоследних КАК ВременнаяТаблицаСтавкиНСПСрезПоследних
		|		ПО ПродажиОбороты.СтавкаНСП = ВременнаяТаблицаСтавкиНСПСрезПоследних.СтавкаНСП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	ПродажиОсновныхСредствОбороты.СуммаДоходаОборот,
		|	ПродажиОсновныхСредствОбороты.СуммаНСПОборот,
		|	ВременнаяТаблицаСтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|ИЗ
		|	РегистрНакопления.ПродажиОсновныхСредств.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			Организация = &Организация
		|				И Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОсновныхСредствОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСтавкиНСПСрезПоследних КАК ВременнаяТаблицаСтавкиНСПСрезПоследних
		|		ПО ПродажиОсновныхСредствОбороты.СтавкаНСП = ВременнаяТаблицаСтавкиНСПСрезПоследних.СтавкаНСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПродажа.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ВременнаяТаблицаПродажа.Выручка) КАК Выручка,
		|	СУММА(ВременнаяТаблицаПродажа.СуммаНСП) КАК СуммаНСП,
		|	ВременнаяТаблицаПродажа.Ставка КАК Ставка,
		|	ВременнаяТаблицаПродажа.СтавкаНСП КАК СтавкаНСП
		|ИЗ
		|	ВременнаяТаблицаПродажа КАК ВременнаяТаблицаПродажа
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаПродажа.БезналичныйРасчет,
		|	ВременнаяТаблицаПродажа.Ставка,
		|	ВременнаяТаблицаПродажа.СтавкаНСП";	
	
	// Если отчеты формируются дл разных ГНС,
	// то добавим отбор по складам
	Если ПолучитьФункциональнуюОпцию("ОтчетыВРазныеГНС") 
		И ЗначениеЗаполнено(ГНС) Тогда
		Запрос.УстановитьПараметр("СкладыПоГНС", СкладыПоГНС());
	Иначе 	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Склад В (&СкладыПоГНС)", "Истина");	
	КонецЕсли;	
	
	Запрос.Текст = ТекстЗапроса;
	
	Если ВидСубъекта = 0 ИЛИ ВидСубъекта = 1 Тогда
		Запрос.УстановитьПараметр("НачалоПериода", НачалоКвартала(Дата));
		Запрос.УстановитьПараметр("КонецПериода", КонецКвартала(Дата));
	Иначе 
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	КонецЕсли; 
	Запрос.УстановитьПараметр("Организация", Организация);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ДанныеУчетнойПолитики.Контракт Тогда
		
		ТаблицаВыручкиСПродаж = РезультатЗапроса.Выгрузить();
		ТаблицаВыручкиСПродаж.Свернуть("БезналичныйРасчет", "Выручка");
		
		Для Каждого СтрокаТаблицы Из ТаблицаВыручкиСПродаж Цикл
			СтрокаТабличнойЧасти = ОтчетОсновной.Добавить();
			
			СтрокаТабличнойЧасти.Строка 		= ?(СтрокаТаблицы.БезналичныйРасчет, "085", "084");
			СтрокаТабличнойЧасти.Содержание 	= ?(СтрокаТаблицы.БезналичныйРасчет, 
										НСтр("ru = 'В БЕЗНАЛИЧНОЙ ФОРМЕ'"),
										НСтр("ru = 'В НАЛИЧНОЙ ФОРМЕ'"));
			СтрокаТабличнойЧасти.Выручка 	= СтрокаТаблицы.Выручка;
		КонецЦикла;	
		
	Иначе		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СтрокаТабличнойЧасти = ОтчетОсновной.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Выборка);
			
			Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.СотоваяСвязь Тогда
				СтрокаТабличнойЧасти.Строка 	= "076";
				СтрокаТабличнойЧасти.Содержание = НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ В СФЕРЕ СОТОВОЙ СВЯЗИ'");
				Продолжить;
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.УслугиБанка Тогда
				СтрокаТабличнойЧасти.Строка 	= "079";
				СтрокаТабличнойЧасти.Содержание = НСтр("ru = 'ПО БАНКОВСКОЙ ДЕЯТЕЛЬНОСТИ'");
				Продолжить;
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ЗастройщикиЖилья Тогда
				СтрокаТабличнойЧасти.Строка 	= "082";
				СтрокаТабличнойЧасти.Содержание = НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ ЗАСТРОЙЩИКОВ ЖИЛЬЯ'");
				Продолжить;	
			КонецЕсли;
			
			Если Выборка.БезналичныйРасчет Тогда
				СтрокаТабличнойЧасти.Ставка = 0;
				Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "053", "066");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");					
				ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "059", "072");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");						
			    КонецЕсли;							
			Иначе
				Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "050", "063");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");					
				ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "056", "069");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");						
			    КонецЕсли;					
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьТабличнуюЧастьОтчетПоНСП()

// Процедура заполняет табличную часть ОтчетОсновной
//
Процедура ЗаполнитьТабличнуюЧастьОтчетПоНСП() Экспорт
		
	Запрос = Новый Запрос;
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	СтавкиНСПСрезПоследних.Ставка КАК Ставка,
		|	СтавкиНСПСрезПоследних.СтавкаНСП КАК СтавкаНСП
		|ПОМЕСТИТЬ ВременнаяТаблицаСтавкиНСПСрезПоследних
		|ИЗ
		|	РегистрСведений.СтавкиНСП.СрезПоследних(&КонецПериода, Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.БезналичныйРасчет КАК БезналичныйРасчет,
		|	ПродажиОбороты.СуммаДоходаОборот КАК Выручка,
		|	ПродажиОбороты.СуммаНСПОборот КАК СуммаНСП,
		|	ВременнаяТаблицаСтавкиНСПСрезПоследних.Ставка КАК Ставка,
		|	ПродажиОбороты.СтавкаНСП КАК СтавкаНСП
		|ПОМЕСТИТЬ ВременнаяТаблицаПродажа
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			Организация = &Организация
		|				И Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				И НЕ ЭкспортУслугПокупателюКР
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСтавкиНСПСрезПоследних КАК ВременнаяТаблицаСтавкиНСПСрезПоследних
		|		ПО ПродажиОбороты.СтавкаНСП = ВременнаяТаблицаСтавкиНСПСрезПоследних.СтавкаНСП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	ПродажиОсновныхСредствОбороты.СуммаДоходаОборот,
		|	ПродажиОсновныхСредствОбороты.СуммаНСПОборот,
		|	ВременнаяТаблицаСтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|ИЗ
		|	РегистрНакопления.ПродажиОсновныхСредств.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			Организация = &Организация
		|				И Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОсновныхСредствОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСтавкиНСПСрезПоследних КАК ВременнаяТаблицаСтавкиНСПСрезПоследних
		|		ПО ПродажиОсновныхСредствОбороты.СтавкаНСП = ВременнаяТаблицаСтавкиНСПСрезПоследних.СтавкаНСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПродажа.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ВременнаяТаблицаПродажа.Выручка) КАК Выручка,
		|	СУММА(ВременнаяТаблицаПродажа.СуммаНСП) КАК СуммаНСП,
		|	ВременнаяТаблицаПродажа.Ставка КАК Ставка,
		|	ВременнаяТаблицаПродажа.СтавкаНСП КАК СтавкаНСП
		|ИЗ
		|	ВременнаяТаблицаПродажа КАК ВременнаяТаблицаПродажа
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаПродажа.БезналичныйРасчет,
		|	ВременнаяТаблицаПродажа.Ставка,
		|	ВременнаяТаблицаПродажа.СтавкаНСП";	
	
	// Если отчеты формируются дл разных ГНС,
	// то добавим отбор по складам
	Если ПолучитьФункциональнуюОпцию("ОтчетыВРазныеГНС") 
		И ЗначениеЗаполнено(ГНС) Тогда
		Запрос.УстановитьПараметр("СкладыПоГНС", СкладыПоГНС());
	Иначе 	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Склад В (&СкладыПоГНС)", "Истина");	
	КонецЕсли;	
	
	Запрос.Текст = ТекстЗапроса;
	
	Если ВидСубъекта = 0 ИЛИ ВидСубъекта = 1 Тогда
		Запрос.УстановитьПараметр("НачалоПериода", НачалоКвартала(Дата));
		Запрос.УстановитьПараметр("КонецПериода", КонецКвартала(Дата));
	Иначе 
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	КонецЕсли; 
	Запрос.УстановитьПараметр("Организация", Организация);	
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТабличнойЧасти = ОтчетОсновной.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Выборка);
		
		Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.СотоваяСвязь Тогда
			СтрокаТабличнойЧасти.Строка 	= "076";
			СтрокаТабличнойЧасти.Содержание = НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ В СФЕРЕ СОТОВОЙ СВЯЗИ'");
			Продолжить;
			
		ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.УслугиБанка Тогда
			СтрокаТабличнойЧасти.Строка 	= "079";
			СтрокаТабличнойЧасти.Содержание = НСтр("ru = 'ПО БАНКОВСКОЙ ДЕЯТЕЛЬНОСТИ'");
			Продолжить;
			
		ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ЗастройщикиЖилья Тогда
			СтрокаТабличнойЧасти.Строка 	= "082";
			СтрокаТабличнойЧасти.Содержание = НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ ЗАСТРОЙЩИКОВ ЖИЛЬЯ'");
			Продолжить;	
		КонецЕсли;
		
		Если Выборка.БезналичныйРасчет Тогда
			СтрокаТабличнойЧасти.Ставка = 0;
			
			Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
				СтрокаТабличнойЧасти.Строка 	= "053";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ И ПРОИЗВОДСТВЕННОЙ СФЕРЕ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");	
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
				СтрокаТабличнойЧасти.Строка 	= "059";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ И ПРОИЗВОДСТВЕННОЙ СФЕРЫ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");						
		    
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ТорговляОсвобожденные Тогда
				СтрокаТабличнойЧасти.Строка 	= "066";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ И ПРОИЗВОДСТВЕННОЙ СФЕРЕ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ПрочееОсвобожденные Тогда
				СтрокаТабличнойЧасти.Строка 	= "072";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ И ПРОИЗВОДСТВЕННОЙ СФЕРЫ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");						
			КонецЕсли;
		Иначе
			Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
				СтрокаТабличнойЧасти.Строка 	= "050";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ И ПРОИЗВОДСТВЕННОЙ СФЕРЕ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");	
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
				СтрокаТабличнойЧасти.Строка 	= "056";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ И ПРОИЗВОДСТВЕННОЙ СФЕРЫ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");						
		    
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ТорговляОсвобожденные Тогда
				СтрокаТабличнойЧасти.Строка 	= "063";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ И ПРОИЗВОДСТВЕННОЙ СФЕРЕ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ПрочееОсвобожденные Тогда
				СтрокаТабличнойЧасти.Строка 	= "069";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ И ПРОИЗВОДСТВЕННОЙ СФЕРЫ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");						
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры // ЗаполнитьТабличнуюЧастьОтчетПоНСП()

// Процедура заполняет табличные части Приложения
//
Процедура Старая_ЗаполнитьТабличныеЧастиПриложениеКОтчетуПоНСП() Экспорт 

	ДанныеУчетнойПолитики = БухгалтерскийУчетСервер.ПолучитьДанныеУчетнойПолитикиОрганизаций(КонецМесяца(Дата), Организация);	
		
	Если ДанныеУчетнойПолитики.ПлательщикНДС Тогда 
		Секция = 1;
	Иначе 
		Секция = 2;
	КонецЕсли;

	Запрос = Новый Запрос;
	ТекстЗапроса =	
		"ВЫБРАТЬ
		|	ПродажиОбороты.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК Выручка,
		|	СУММА(ПродажиОбороты.СуммаНСПОборот) КАК СуммаНСП,
		|	СтавкиНСПСрезПоследних.Ставка КАК Ставка,
		|	ПродажиОбороты.СтавкаНСП КАК СтавкаНСП
		|ПОМЕСТИТЬ ВременнаяТаблицаПервыйМесяц
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			&НачалоКвартала,
		|			КОНЕЦПЕРИОДА(&НачалоКвартала, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|				И Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних(КОНЕЦПЕРИОДА(&НачалоКвартала, МЕСЯЦ), Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|		ПО ПродажиОбороты.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОбороты.БезналичныйРасчет,
		|	ПродажиОбороты.СтавкаНСП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	СУММА(ПродажиОсновныхСредствОбороты.СуммаОборот),
		|	СУММА(ПродажиОсновныхСредствОбороты.СуммаНСПОборот),
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|ИЗ
		|	РегистрНакопления.ПродажиОсновныхСредств.Обороты(
		|			&НачалоКвартала,
		|			КОНЕЦПЕРИОДА(&НачалоКвартала, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|				И Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОсновныхСредствОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних(КОНЕЦПЕРИОДА(&НачалоКвартала, МЕСЯЦ), Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|		ПО ПродажиОсновныхСредствОбороты.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК Выручка,
		|	СУММА(ПродажиОбороты.СуммаНСПОборот) КАК СуммаНСП,
		|	СтавкиНСПСрезПоследних.Ставка КАК Ставка,
		|	ПродажиОбороты.СтавкаНСП КАК СтавкаНСП
		|ПОМЕСТИТЬ ВременнаяТаблицаВторойМесяц
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			НАЧАЛОПЕРИОДА(&ВторойМесяцКвартала, МЕСЯЦ),
		|			КОНЕЦПЕРИОДА(&ВторойМесяцКвартала, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|				И Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних(КОНЕЦПЕРИОДА(&ВторойМесяцКвартала, МЕСЯЦ), Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|		ПО ПродажиОбороты.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОбороты.БезналичныйРасчет,
		|	ПродажиОбороты.СтавкаНСП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	СУММА(ПродажиОсновныхСредствОбороты.СуммаОборот),
		|	СУММА(ПродажиОсновныхСредствОбороты.СуммаНСПОборот),
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|ИЗ
		|	РегистрНакопления.ПродажиОсновныхСредств.Обороты(
		|			НАЧАЛОПЕРИОДА(&ВторойМесяцКвартала, МЕСЯЦ),
		|			КОНЕЦПЕРИОДА(&ВторойМесяцКвартала, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|				И Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОсновныхСредствОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних(КОНЕЦПЕРИОДА(&ВторойМесяцКвартала, МЕСЯЦ), Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|		ПО ПродажиОсновныхСредствОбороты.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК Выручка,
		|	СУММА(ПродажиОбороты.СуммаНСПОборот) КАК СуммаНСП,
		|	СтавкиНСПСрезПоследних.Ставка КАК Ставка,
		|	ПродажиОбороты.СтавкаНСП КАК СтавкаНСП
		|ПОМЕСТИТЬ ВременнаяТаблицаТретийМесяц
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			НАЧАЛОПЕРИОДА(&КонецКвартала, МЕСЯЦ),
		|			КОНЕЦПЕРИОДА(&КонецКвартала, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|				И Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних(КОНЕЦПЕРИОДА(&КонецКвартала, МЕСЯЦ), Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|		ПО ПродажиОбороты.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОбороты.БезналичныйРасчет,
		|	ПродажиОбороты.СтавкаНСП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	СУММА(ПродажиОсновныхСредствОбороты.СуммаОборот),
		|	СУММА(ПродажиОсновныхСредствОбороты.СуммаНСПОборот),
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|ИЗ
		|	РегистрНакопления.ПродажиОсновныхСредств.Обороты(
		|			НАЧАЛОПЕРИОДА(&КонецКвартала, МЕСЯЦ),
		|			КОНЕЦПЕРИОДА(&КонецКвартала, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|				И Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОсновныхСредствОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних(КОНЕЦПЕРИОДА(&КонецКвартала, МЕСЯЦ), Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|		ПО ПродажиОсновныхСредствОбороты.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПервыйМесяц.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ВременнаяТаблицаПервыйМесяц.Выручка) КАК Выручка,
		|	СУММА(ВременнаяТаблицаПервыйМесяц.СуммаНСП) КАК СуммаНСП,
		|	ВременнаяТаблицаПервыйМесяц.Ставка КАК Ставка,
		|	ВременнаяТаблицаПервыйМесяц.СтавкаНСП КАК СтавкаНСП
		|ИЗ
		|	ВременнаяТаблицаПервыйМесяц КАК ВременнаяТаблицаПервыйМесяц
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаПервыйМесяц.БезналичныйРасчет,
		|	ВременнаяТаблицаПервыйМесяц.Ставка,
		|	ВременнаяТаблицаПервыйМесяц.СтавкаНСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаВторойМесяц.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ВременнаяТаблицаВторойМесяц.Выручка) КАК Выручка,
		|	СУММА(ВременнаяТаблицаВторойМесяц.СуммаНСП) КАК СуммаНСП,
		|	ВременнаяТаблицаВторойМесяц.Ставка КАК Ставка,
		|	ВременнаяТаблицаВторойМесяц.СтавкаНСП КАК СтавкаНСП
		|ИЗ
		|	ВременнаяТаблицаВторойМесяц КАК ВременнаяТаблицаВторойМесяц
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаВторойМесяц.БезналичныйРасчет,
		|	ВременнаяТаблицаВторойМесяц.Ставка,
		|	ВременнаяТаблицаВторойМесяц.СтавкаНСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаТретийМесяц.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ВременнаяТаблицаТретийМесяц.Выручка) КАК Выручка,
		|	СУММА(ВременнаяТаблицаТретийМесяц.СуммаНСП) КАК СуммаНСП,
		|	ВременнаяТаблицаТретийМесяц.Ставка КАК Ставка,
		|	ВременнаяТаблицаТретийМесяц.СтавкаНСП КАК СтавкаНСП
		|ИЗ
		|	ВременнаяТаблицаТретийМесяц КАК ВременнаяТаблицаТретийМесяц
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаТретийМесяц.БезналичныйРасчет,
		|	ВременнаяТаблицаТретийМесяц.Ставка,
		|	ВременнаяТаблицаТретийМесяц.СтавкаНСП";	
	// Если отчеты формируются дл разных ГНС,
	// то добавим отбор по складам
	Если ПолучитьФункциональнуюОпцию("ОтчетыВРазныеГНС") 
		И ЗначениеЗаполнено(ГНС) Тогда
		Запрос.УстановитьПараметр("СкладыПоГНС", СкладыПоГНС());
	Иначе 	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Склад В (&СкладыПоГНС)", "Истина");	
	КонецЕсли;	
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("НачалоКвартала", НачалоКвартала(Дата));	
	Запрос.УстановитьПараметр("ВторойМесяцКвартала", ДобавитьМесяц(НачалоКвартала(Дата),+1));	
	Запрос.УстановитьПараметр("КонецКвартала", КонецКвартала(Дата));	
	Запрос.УстановитьПараметр("Организация", Организация);	
	Запрос.УстановитьПараметр("ПлательщикНДС", ?(Секция = 2, Ложь, Истина));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();		
	
	Если ДанныеУчетнойПолитики.Контракт Тогда
		
		// Первый месяц
		ТаблцаВыручкиЗаПервыйМесяц = РезультатЗапроса[3].Выгрузить();
		ТаблцаВыручкиЗаПервыйМесяц.Свернуть("БезналичныйРасчет", "Выручка");
		
		Для Каждого СтрокаТаблицы Из ТаблцаВыручкиЗаПервыйМесяц Цикл
			СтрокаТабличнойЧасти = ПриложениеПервыйМесяцКвартала.Добавить();
			
			СтрокаТабличнойЧасти.Строка 		= ?(СтрокаТаблицы.БезналичныйРасчет, "185", "184");
			СтрокаТабличнойЧасти.Содержание 	= ?(СтрокаТаблицы.БезналичныйРасчет, 
										НСтр("ru = 'В БЕЗНАЛИЧНОЙ ФОРМЕ'"),
										НСтр("ru = 'В НАЛИЧНОЙ ФОРМЕ'"));
			СтрокаТабличнойЧасти.Выручка 	= СтрокаТаблицы.Выручка;
		КонецЦикла;
		
		// Второй месяц
		ТаблцаВыручкиЗаВторойМесяц = РезультатЗапроса[4].Выгрузить();
		ТаблцаВыручкиЗаВторойМесяц.Свернуть("БезналичныйРасчет", "Выручка");
		
		Для Каждого СтрокаТаблицы Из ТаблцаВыручкиЗаВторойМесяц Цикл
			СтрокаТабличнойЧасти = ПриложениеВторойМесяцКвартала.Добавить();
			
			СтрокаТабличнойЧасти.Строка 		= ?(СтрокаТаблицы.БезналичныйРасчет, "235", "234");
			СтрокаТабличнойЧасти.Содержание 	= ?(СтрокаТаблицы.БезналичныйРасчет, 
										НСтр("ru = 'В БЕЗНАЛИЧНОЙ ФОРМЕ'"),
										НСтр("ru = 'В НАЛИЧНОЙ ФОРМЕ'"));
			СтрокаТабличнойЧасти.Выручка 	= СтрокаТаблицы.Выручка;
		КонецЦикла;
		
		// Третий месяц
		ТаблцаВыручкиЗаТретийМесяц = РезультатЗапроса[5].Выгрузить();
		ТаблцаВыручкиЗаТретийМесяц.Свернуть("БезналичныйРасчет", "Выручка");
		
		Для Каждого СтрокаТаблицы Из ТаблцаВыручкиЗаТретийМесяц Цикл
			СтрокаТабличнойЧасти = ПриложениеТретийМесяцКвартала.Добавить();
			
			СтрокаТабличнойЧасти.Строка 		= ?(СтрокаТаблицы.БезналичныйРасчет, "285", "284");
			СтрокаТабличнойЧасти.Содержание 	= ?(СтрокаТаблицы.БезналичныйРасчет, 
										НСтр("ru = 'В БЕЗНАЛИЧНОЙ ФОРМЕ'"),
										НСтр("ru = 'В НАЛИЧНОЙ ФОРМЕ'"));
			СтрокаТабличнойЧасти.Выручка 	= СтрокаТаблицы.Выручка;
		КонецЦикла;
		
	Иначе	
		// Первый месяц
		Выборка = РезультатЗапроса[3].Выбрать();	
		Пока Выборка.Следующий() Цикл
			
			СтрокаТабличнойЧасти = ПриложениеПервыйМесяцКвартала.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Выборка);
					
			Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.СотоваяСвязь Тогда
				СтрокаТабличнойЧасти.Строка 	= "176";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ В СФЕРЕ СОТОВОЙ СВЯЗИ'");
				Продолжить;
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.УслугиБанка Тогда
				СтрокаТабличнойЧасти.Строка 	= "179";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО БАНКОВСКОЙ ДЕЯТЕЛЬНОСТИ'");
				Продолжить;
			КонецЕсли;
					
			Если Выборка.БезналичныйРасчет Тогда
				СтрокаТабличнойЧасти.Ставка = 0;

				Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "153", "166");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");					
				ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "159", "172");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");						
			    КонецЕсли;							
			Иначе
				Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "150", "163");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");					
				ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "156", "169");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");						
			    КонецЕсли;					
			КонецЕсли;
		КонецЦикла;

		// Второй месяц
		Выборка = РезультатЗапроса[4].Выбрать();	
		Пока Выборка.Следующий() Цикл
			
			СтрокаТабличнойЧасти = ПриложениеВторойМесяцКвартала.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Выборка);
					
			Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.СотоваяСвязь Тогда
				СтрокаТабличнойЧасти.Строка 	= "226";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ В СФЕРЕ СОТОВОЙ СВЯЗИ'");
				Продолжить;
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.УслугиБанка Тогда
				СтрокаТабличнойЧасти.Строка 	= "229";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО БАНКОВСКОЙ ДЕЯТЕЛЬНОСТИ'");
				Продолжить;
			КонецЕсли;
					
			Если Выборка.БезналичныйРасчет Тогда
				СтрокаТабличнойЧасти.Ставка = 0;

				Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "203", "216");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");					
				ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "209", "222");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");						
			    КонецЕсли;							
			Иначе
				Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "200", "213");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");					
				ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "206", "219");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");						
			    КонецЕсли;					
			КонецЕсли;
		КонецЦикла;

		
		// Третий месяц
		Выборка = РезультатЗапроса[5].Выбрать();	
		Пока Выборка.Следующий() Цикл
			СтрокаТабличнойЧасти = ПриложениеТретийМесяцКвартала.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Выборка);
			
			Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.СотоваяСвязь Тогда
				СтрокаТабличнойЧасти.Строка 	= "276";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ В СФЕРЕ СОТОВОЙ СВЯЗИ'");
				Продолжить;
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.УслугиБанка Тогда
				СтрокаТабличнойЧасти.Строка 	= "279";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО БАНКОВСКОЙ ДЕЯТЕЛЬНОСТИ'");
				Продолжить;
			КонецЕсли;
			
			Если Выборка.БезналичныйРасчет Тогда
				СтрокаТабличнойЧасти.Ставка = 0;

				Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "253", "266");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");					
				ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "259", "272");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");						
				КонецЕсли;							
			Иначе
				Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "250", "263");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");					
				ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "256", "269");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");						
				КонецЕсли;					
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Процедура заполняет табличные части Приложения
//
Процедура ЗаполнитьТабличныеЧастиПриложениеКОтчетуПоНСП() Экспорт 

	Запрос = Новый Запрос;
	ТекстЗапроса =	
		"ВЫБРАТЬ
		|	ПродажиОбороты.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК Выручка,
		|	СУММА(ПродажиОбороты.СуммаНСПОборот) КАК СуммаНСП,
		|	СтавкиНСПСрезПоследних.Ставка КАК Ставка,
		|	ПродажиОбороты.СтавкаНСП КАК СтавкаНСП
		|ПОМЕСТИТЬ ВременнаяТаблицаПервыйМесяц
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			&НачалоКвартала,
		|			КОНЕЦПЕРИОДА(&НачалоКвартала, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|				И Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних(КОНЕЦПЕРИОДА(&НачалоКвартала, МЕСЯЦ), Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|		ПО ПродажиОбороты.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОбороты.БезналичныйРасчет,
		|	ПродажиОбороты.СтавкаНСП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	СУММА(ПродажиОсновныхСредствОбороты.СуммаОборот),
		|	СУММА(ПродажиОсновныхСредствОбороты.СуммаНСПОборот),
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|ИЗ
		|	РегистрНакопления.ПродажиОсновныхСредств.Обороты(
		|			&НачалоКвартала,
		|			КОНЕЦПЕРИОДА(&НачалоКвартала, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|				И Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОсновныхСредствОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних(КОНЕЦПЕРИОДА(&НачалоКвартала, МЕСЯЦ), Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|		ПО ПродажиОсновныхСредствОбороты.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК Выручка,
		|	СУММА(ПродажиОбороты.СуммаНСПОборот) КАК СуммаНСП,
		|	СтавкиНСПСрезПоследних.Ставка КАК Ставка,
		|	ПродажиОбороты.СтавкаНСП КАК СтавкаНСП
		|ПОМЕСТИТЬ ВременнаяТаблицаВторойМесяц
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			НАЧАЛОПЕРИОДА(&ВторойМесяцКвартала, МЕСЯЦ),
		|			КОНЕЦПЕРИОДА(&ВторойМесяцКвартала, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|				И Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних(КОНЕЦПЕРИОДА(&ВторойМесяцКвартала, МЕСЯЦ), Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|		ПО ПродажиОбороты.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОбороты.БезналичныйРасчет,
		|	ПродажиОбороты.СтавкаНСП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	СУММА(ПродажиОсновныхСредствОбороты.СуммаОборот),
		|	СУММА(ПродажиОсновныхСредствОбороты.СуммаНСПОборот),
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|ИЗ
		|	РегистрНакопления.ПродажиОсновныхСредств.Обороты(
		|			НАЧАЛОПЕРИОДА(&ВторойМесяцКвартала, МЕСЯЦ),
		|			КОНЕЦПЕРИОДА(&ВторойМесяцКвартала, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|				И Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОсновныхСредствОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних(КОНЕЦПЕРИОДА(&ВторойМесяцКвартала, МЕСЯЦ), Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|		ПО ПродажиОсновныхСредствОбороты.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК Выручка,
		|	СУММА(ПродажиОбороты.СуммаНСПОборот) КАК СуммаНСП,
		|	СтавкиНСПСрезПоследних.Ставка КАК Ставка,
		|	ПродажиОбороты.СтавкаНСП КАК СтавкаНСП
		|ПОМЕСТИТЬ ВременнаяТаблицаТретийМесяц
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			НАЧАЛОПЕРИОДА(&КонецКвартала, МЕСЯЦ),
		|			КОНЕЦПЕРИОДА(&КонецКвартала, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|				И Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних(КОНЕЦПЕРИОДА(&КонецКвартала, МЕСЯЦ), Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|		ПО ПродажиОбороты.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОбороты.БезналичныйРасчет,
		|	ПродажиОбороты.СтавкаНСП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	СУММА(ПродажиОсновныхСредствОбороты.СуммаОборот),
		|	СУММА(ПродажиОсновныхСредствОбороты.СуммаНСПОборот),
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|ИЗ
		|	РегистрНакопления.ПродажиОсновныхСредств.Обороты(
		|			НАЧАЛОПЕРИОДА(&КонецКвартала, МЕСЯЦ),
		|			КОНЕЦПЕРИОДА(&КонецКвартала, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|				И Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОсновныхСредствОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних(КОНЕЦПЕРИОДА(&КонецКвартала, МЕСЯЦ), Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|		ПО ПродажиОсновныхСредствОбороты.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПервыйМесяц.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ВременнаяТаблицаПервыйМесяц.Выручка) КАК Выручка,
		|	СУММА(ВременнаяТаблицаПервыйМесяц.СуммаНСП) КАК СуммаНСП,
		|	ВременнаяТаблицаПервыйМесяц.Ставка КАК Ставка,
		|	ВременнаяТаблицаПервыйМесяц.СтавкаНСП КАК СтавкаНСП
		|ИЗ
		|	ВременнаяТаблицаПервыйМесяц КАК ВременнаяТаблицаПервыйМесяц
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаПервыйМесяц.БезналичныйРасчет,
		|	ВременнаяТаблицаПервыйМесяц.Ставка,
		|	ВременнаяТаблицаПервыйМесяц.СтавкаНСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаВторойМесяц.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ВременнаяТаблицаВторойМесяц.Выручка) КАК Выручка,
		|	СУММА(ВременнаяТаблицаВторойМесяц.СуммаНСП) КАК СуммаНСП,
		|	ВременнаяТаблицаВторойМесяц.Ставка КАК Ставка,
		|	ВременнаяТаблицаВторойМесяц.СтавкаНСП КАК СтавкаНСП
		|ИЗ
		|	ВременнаяТаблицаВторойМесяц КАК ВременнаяТаблицаВторойМесяц
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаВторойМесяц.БезналичныйРасчет,
		|	ВременнаяТаблицаВторойМесяц.Ставка,
		|	ВременнаяТаблицаВторойМесяц.СтавкаНСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаТретийМесяц.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ВременнаяТаблицаТретийМесяц.Выручка) КАК Выручка,
		|	СУММА(ВременнаяТаблицаТретийМесяц.СуммаНСП) КАК СуммаНСП,
		|	ВременнаяТаблицаТретийМесяц.Ставка КАК Ставка,
		|	ВременнаяТаблицаТретийМесяц.СтавкаНСП КАК СтавкаНСП
		|ИЗ
		|	ВременнаяТаблицаТретийМесяц КАК ВременнаяТаблицаТретийМесяц
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаТретийМесяц.БезналичныйРасчет,
		|	ВременнаяТаблицаТретийМесяц.Ставка,
		|	ВременнаяТаблицаТретийМесяц.СтавкаНСП";	
	// Если отчеты формируются дл разных ГНС,
	// то добавим отбор по складам
	Если ПолучитьФункциональнуюОпцию("ОтчетыВРазныеГНС") 
		И ЗначениеЗаполнено(ГНС) Тогда
		Запрос.УстановитьПараметр("СкладыПоГНС", СкладыПоГНС());
	Иначе 	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Склад В (&СкладыПоГНС)", "Истина");	
	КонецЕсли;	
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("НачалоКвартала", НачалоКвартала(Дата));	
	Запрос.УстановитьПараметр("ВторойМесяцКвартала", ДобавитьМесяц(НачалоКвартала(Дата),+1));	
	Запрос.УстановитьПараметр("КонецКвартала", КонецКвартала(Дата));	
	Запрос.УстановитьПараметр("Организация", Организация);	
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();		
	
	// Первый месяц
	Выборка = РезультатЗапроса[3].Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТабличнойЧасти = ПриложениеПервыйМесяцКвартала.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Выборка);
				
		Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.СотоваяСвязь Тогда
			СтрокаТабличнойЧасти.Строка 	= "176";
			СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ В СФЕРЕ СОТОВОЙ СВЯЗИ'");
			Продолжить;
			
		ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.УслугиБанка Тогда
			СтрокаТабличнойЧасти.Строка 	= "179";
			СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО БАНКОВСКОЙ ДЕЯТЕЛЬНОСТИ'");
			Продолжить;
			
		ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ЗастройщикиЖилья Тогда
			СтрокаТабличнойЧасти.Строка 	= "182";
			СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ ЗАСТРОЙЩИКОВ ЖИЛЬЯ'");
			Продолжить;	
		КонецЕсли;
		
		Если Выборка.БезналичныйРасчет Тогда
			СтрокаТабличнойЧасти.Ставка = 0;
			
			Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда				
				СтрокаТабличнойЧасти.Строка 	= "153";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");	
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
				СтрокаТабличнойЧасти.Строка 	= "159";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");						
		   
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ТорговляОсвобожденные Тогда
				СтрокаТабличнойЧасти.Строка 	= "166";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ПрочееОсвобожденные Тогда
				СтрокаТабличнойЧасти.Строка 	= "172";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");						
			КонецЕсли;	
		Иначе
			Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
				СтрокаТабличнойЧасти.Строка 	= "150";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");	
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
				СтрокаТабличнойЧасти.Строка 	= "156";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");						
		   
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ТорговляОсвобожденные Тогда
				СтрокаТабличнойЧасти.Строка 	= "163";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ПрочееОсвобожденные Тогда
				СтрокаТабличнойЧасти.Строка 	= "169";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");						
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;

	// Второй месяц
	Выборка = РезультатЗапроса[4].Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТабличнойЧасти = ПриложениеВторойМесяцКвартала.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Выборка);
				
		Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.СотоваяСвязь Тогда
			СтрокаТабличнойЧасти.Строка 	= "226";
			СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ В СФЕРЕ СОТОВОЙ СВЯЗИ'");
			Продолжить;
			
		ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.УслугиБанка Тогда
			СтрокаТабличнойЧасти.Строка 	= "229";
			СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО БАНКОВСКОЙ ДЕЯТЕЛЬНОСТИ'");
			Продолжить;
			
		ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ЗастройщикиЖилья Тогда
			СтрокаТабличнойЧасти.Строка 	= "232";
			СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ ЗАСТРОЙЩИКОВ ЖИЛЬЯ'");
			Продолжить;	
		КонецЕсли;
				
		Если Выборка.БезналичныйРасчет Тогда
			СтрокаТабличнойЧасти.Ставка = 0;
			
			Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда				
				СтрокаТабличнойЧасти.Строка 	= "203";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");	
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
				СтрокаТабличнойЧасти.Строка 	= "209";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");						
		   
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ТорговляОсвобожденные Тогда
				СтрокаТабличнойЧасти.Строка 	= "216";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ПрочееОсвобожденные Тогда
				СтрокаТабличнойЧасти.Строка 	= "222";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");						
			КонецЕсли;	
		Иначе
			Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
				СтрокаТабличнойЧасти.Строка 	= "200";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");	
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
				СтрокаТабличнойЧасти.Строка 	= "206";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");						
		   
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ТорговляОсвобожденные Тогда
				СтрокаТабличнойЧасти.Строка 	= "213";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ПрочееОсвобожденные Тогда
				СтрокаТабличнойЧасти.Строка 	= "219";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");						
			КонецЕсли;	
		КонецЕсли;					
	КонецЦикла;

	
	// Третий месяц
	Выборка = РезультатЗапроса[5].Выбрать();	
	Пока Выборка.Следующий() Цикл
		СтрокаТабличнойЧасти = ПриложениеТретийМесяцКвартала.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Выборка);
		
		Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.СотоваяСвязь Тогда
			СтрокаТабличнойЧасти.Строка 	= "276";
			СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ В СФЕРЕ СОТОВОЙ СВЯЗИ'");
			Продолжить;
			
		ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.УслугиБанка Тогда
			СтрокаТабличнойЧасти.Строка 	= "279";
			СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО БАНКОВСКОЙ ДЕЯТЕЛЬНОСТИ'");
			Продолжить;
			
		ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ЗастройщикиЖилья Тогда
			СтрокаТабличнойЧасти.Строка 	= "282";
			СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ ЗАСТРОЙЩИКОВ ЖИЛЬЯ'");
			Продолжить;	
		КонецЕсли;
		
		Если Выборка.БезналичныйРасчет Тогда
			СтрокаТабличнойЧасти.Ставка = 0;
			
			Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда				
				СтрокаТабличнойЧасти.Строка 	= "253";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");	
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
				СтрокаТабличнойЧасти.Строка 	= "259";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");						
		   
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ТорговляОсвобожденные Тогда
				СтрокаТабличнойЧасти.Строка 	= "266";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ПрочееОсвобожденные Тогда
				СтрокаТабличнойЧасти.Строка 	= "272";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");						
			КонецЕсли;	
		Иначе
			Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
				СтрокаТабличнойЧасти.Строка 	= "250";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");	
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
				СтрокаТабличнойЧасти.Строка 	= "256";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");						
		   
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ТорговляОсвобожденные Тогда
				СтрокаТабличнойЧасти.Строка 	= "263";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.ПрочееОсвобожденные Тогда
				СтрокаТабличнойЧасти.Строка 	= "269";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");						
			КонецЕсли;	
		КонецЕсли;						
	КонецЦикла;
КонецПроцедуры

Функция СкладыПоГНС()
	
	ПодразделенияПоГНС = БухгалтерскиеОтчеты.ПодразделенияПоГНС(Организация, ГНС);
	
	// Склады по подразделениям.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Ссылка КАК Склад
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.ПодразделениеОрганизации В(&ПодразделенияПоГНС)";
	Запрос.УстановитьПараметр("ПодразделенияПоГНС", ПодразделенияПоГНС);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад");

КонецФункции // СкладыПоГНС()

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
